Tutorials/BuoyantCavity/BaseCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;


// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 0.006666666;

// Thermal expansion coefficient
beta              [0 0 0 -1 0 0 0] 0.0254841997961264;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 300;

// Prandtl
Pr              [0 0 0 0 0 0 0] 0.71;

// Turbulent Prandlt
Prt             [0 0 0 0 0 0 0] 0.85;

// ************************************************************************* //
